# choose data (basic)

In [1]:
import pandas as pd
df = pd.read_csv("score.csv")
df

,number,Name,School,Height,Korean,English,Math,Science,Social,SW Skill
0,1,Cha Chi-soo,Buk San High,197,90,85,100,95,85,Python
1,2,Jung Dae-man,Buk San High,184,40,35,50,55,25,Java
2,3,Song Tae-seop,Buk San High,168,80,75,70,80,75,Javascript
3,4,Seo Tae-woong,Buk San High,187,40,60,70,75,80,NaN
4,5,Kang Baek-ho,Buk San High,188,15,20,10,35,10,NaN
5,6,Byun Deok-gyu,Neung Nam High,202,80,100,95,85,80,C
6,7,Hwang Tae-san,Neung Nam High,188,55,65,45,40,35,PYTHON
7,8,Yoon Dae-hyeop,Neung Nam High,190,100,85,90,95,95,C#

# column

In [2]:
df["Name"]

0       Cha Chi-soo
1      Jung Dae-man
2     Song Tae-seop
3     Seo Tae-woong
4      Kang Baek-ho
5     Byun Deok-gyu
6     Hwang Tae-san
7    Yoon Dae-hyeop
Name: Name, dtype: object

In [4]:
df[["Name", "Height"]]

             Name  Height
0     Cha Chi-soo     197
1    Jung Dae-man     184
2   Song Tae-seop     168
3   Seo Tae-woong     187
4    Kang Baek-ho     188
5   Byun Deok-gyu     202
6   Hwang Tae-san     188
7  Yoon Dae-hyeop     190

In [5]:
df.set_index("number", inplace=True)

In [6]:
df.columns[0]

'Name'

In [7]:
df.columns[0]

'Name'

In [8]:
df[df.columns[0]]

number
1       Cha Chi-soo
2      Jung Dae-man
3     Song Tae-seop
4     Seo Tae-woong
5      Kang Baek-ho
6     Byun Deok-gyu
7     Hwang Tae-san
8    Yoon Dae-hyeop
Name: Name, dtype: object

In [16]:
df[:][3:4]

,Name,School,Height,Korean,English,Math,Science,Social,SW Skill
number,,,,,,,,,
4,Seo Tae-woong,Buk San High,187,40,60,70,75,80,NaN

In [17]:
df[3:4]

,Name,School,Height,Korean,English,Math,Science,Social,SW Skill
number,,,,,,,,,
4,Seo Tae-woong,Buk San High,187,40,60,70,75,80,NaN